InformationRegisters/ФИОФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ФИОФизическихЛиц</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ФизическиеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ФизическиеЛица</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Document.Встреча</xr:Item>
				<xr:Item>Document.ТелефонныйЗвонок</xr:Item>
				<xr:Item>Document.ЭлектронноеПисьмоВходящее</xr:Item>
				<xr:Item>Document.ЭлектронноеПисьмоИсходящее</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Comment>Дата рождения</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Comment>Пол</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УточнениеНаименования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьУточнение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КР_ЭтоВодитель</Name>
					<Comment>Jira№ A2105505-32</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КР_Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КР_Должность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КР_Уволен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КР_ЭтоВодительРозницы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КР_ИдентификаторЗУП</Name>
					<Comment>JIRA№ A2105505-2421</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/КР_ЗУП_УТ11_ЗагрузкаДанныхСервер/Ext/Module.bsl
////////////////////////////////////////////////////
//// Объект ОбщийМодуль.КР_ЗУП_УТ11_ЗагрузкаДанныхСервер
//// Предназначен для загрузки данных из ЗУП
//// Создан: 29.09.2022 Маскаев П.Ю., КРОК, JIRA№ A2105505-570

#Область ПрограммныйИнтерфейс

Функция ДобавитьНастройкиЗагрузкиОбъектов(ПараметрыЗагрузки) Экспорт
	
	НастройкаЗагрузки(ПараметрыЗагрузки, "PersonObject");

	Возврат ПараметрыЗагрузки; 
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфес

#Область ПравилаЗагрузкиОбъектов

Процедура ПЗО_PersonObject(СообщениеОбмена) Экспорт
	
	// Получаем пакет
	ПакетДанных = СообщениеОбмена.Данные;
	
	//// Конвертируем в объект
	//Объект = Неопределено;
	//Если Не ПКО_СправочникОбъектФизическиеЛица(ПакетДанных, Объект, СообщениеОбмена)
	//	Или Не КР_ОбменRabbitОбщиеМеханизмыКонвертации.СправочникОбъектЗаписать(Объект, СообщениеОбмена) Тогда
	//	Возврат;
	//КонецЕсли;
	
	// Конвертируем в объект
	// Конвертация производится в транзакции для обеспечения целостности данных
	НачатьТранзакцию();
	Попытка
		Объект = Неопределено;
		Если ПКО_СправочникОбъектФизическиеЛица(ПакетДанных, Объект, СообщениеОбмена)
			И КР_ОбменRabbitОбщиеМеханизмыКонвертации.СправочникОбъектЗаписать(Объект, СообщениеОбмена) Тогда
			ЗафиксироватьТранзакцию();
		Иначе
			ОтменитьТранзакцию();
		КонецЕсли;
	Исключение
		Если ТранзакцияАктивна() Тогда
			ОтменитьТранзакцию();
		КонецЕсли;
		
		ТекстСообщения = НСтр("ru = 'В процессе загрузки данных физического лица произошла исключительная ошибка:
			|%1'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КР_ОбменRabbitОбработкаСообщенийОбмена.ДобавитьЗаписьВЛог(СообщениеОбмена, ТекстСообщения,
			КР_ОбменRabbitОбработкаСообщенийОбмена.ТипЗаписиВЛог_Ошибка(Метаданные.Справочники.ФизическиеЛица));
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ПравилаКонвертации

#Область Справочники

Функция ПКО_СправочникОбъектФизическиеЛица(ПакетДанных, Объект, СообщениеОбмена)
	
	Ссылка = XMLЗначение(Тип("СправочникСсылка.ФизическиеЛица"), ПакетДанных.Ref);
	ЭтоНовый = Не ОбщегоНазначения.СсылкаСуществует(Ссылка);
	
	Если ЭтоНовый Тогда
		Если ПакетДанных.Group Тогда
			Объект = Справочники.ФизическиеЛица.СоздатьГруппу();
		Иначе
			Объект = Справочники.ФизическиеЛица.СоздатьЭлемент();
		КонецЕсли;
		Объект.УстановитьСсылкуНового(Ссылка);
	Иначе
		Объект = Ссылка.ПолучитьОбъект();
	КонецЕсли;
	
	Объект.Родитель = ПКО_СправочникСсылкаФизическиеЛицаРодитель(ПакетДанных, СообщениеОбмена);
	Объект.Наименование = ПакетДанных.Name;
	Объект.ПометкаУдаления = ПакетДанных.DeletionMark;
	Если Не Объект.ЭтоГруппа Тогда
		Объект.ДатаРождения = ПакетДанных.Birthday;
		Объект.Пол = ПредопределенноеЗначение("Перечисление.ПолФизическогоЛица." + ПакетДанных.Gender);
		Объект.КР_Подразделение = ПКО_СправочникСсылкаПодразделение(ПакетДанных, СообщениеОбмена);
		Объект.КР_Должность = ПакетДанных.Position;
		
		Если ВРег(ПакетДанных.Event) = "УВОЛЬНЕНИЕ" Тогда
			Объект.КР_Уволен = Истина;
		Иначе
			Объект.КР_Уволен = Ложь;
		КонецЕсли;

		// << 09.11.2023 Марченко С.Н., КРОК, JIRA№A2105505-2486 
		// Дублируем сознательно на случай если потребуется разделить ссылку и GUID
		// Реквизит используется для выгрузки в СБИС
		Объект.КР_ИдентификаторЗУП = ПакетДанных.Ref;
		// >> 09.11.2023 Марченко С.Н., КРОК, JIRA№A2105505-2486

		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПакетДанных, "FIOHistory")
				И Не ПКО_РегистрСведенийФИОФизическихЛиц(ПакетДанных.FIOHistory, Ссылка, СообщениеОбмена) Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ПКО_СправочникСсылкаФизическиеЛицаРодитель(ПакетДанных, СообщениеОбмена)
	
	Если ПакетДанных.Parent = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Ссылка = XMLЗначение(Тип("СправочникСсылка.ФизическиеЛица"), ПакетДанных.Parent.Ref);
	Если ОбщегоНазначения.СсылкаСуществует(Ссылка) Тогда
		Возврат Ссылка;
	Иначе
		ТекстСообщения = НСтр("ru = 'Элемент справочника ""Физические лица"" ""%1""
			|при создании/редактировании элемента справочника ""Физические лица"" ""%2"" не найден'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ПакетДанных.Parent.Name, ПакетДанных.Name);
		ТипОшибки = КР_ОбменRabbitОбработкаСообщенийОбмена.ТипЗаписиВЛог_НекритичнаяОшибкаПоискаСсылки(
			Метаданные.Справочники.ФизическиеЛица);
		
		КР_ОбменRabbitОбработкаСообщенийОбмена.ДобавитьЗаписьВЛог(СообщениеОбмена, ТекстСообщения, ТипОшибки);
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ПКО_СправочникСсылкаПодразделение(ПакетДанных, СообщениеОбмена)
	
	Если ПакетДанных.Department = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Ссылка = XMLЗначение(Тип("СправочникСсылка.СтруктураПредприятия"), ПакетДанных.Department.Ref);
	Если Не ОбщегоНазначения.СсылкаСуществует(Ссылка) Тогда
		Ссылка = Справочники.СтруктураПредприятия.НайтиПоКоду(ПакетДанных.Department.Code);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		Возврат Ссылка;
	Иначе
		ТекстСообщения = НСтр("ru = 'Элемент справочника ""Структура предприятия"" ""%1""
			|при создании/редактировании элемента справочника ""Физические лица"" ""%2"" не найден'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ПакетДанных.Department.Name, ПакетДанных.Name);
		ТипОшибки = КР_ОбменRabbitОбработкаСообщенийОбмена.ТипЗаписиВЛог_НекритичнаяОшибкаПоискаСсылки(
			Метаданные.Справочники.СтруктураПредприятия);
		
		КР_ОбменRabbitОбработкаСообщенийОбмена.ДобавитьЗаписьВЛог(СообщениеОбмена, ТекстСообщения, ТипОшибки);
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область РегистрыСведений

Функция ПКО_РегистрСведенийФИОФизическихЛиц(ПакетДанных, ФизЛицо, СообщениеОбмена)
	
	Если ПакетДанных = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	
	Для Каждого СтрокаДанных Из ПакетДанных.FIOHistorySingleRow Цикл
		
		НаборЗаписей = РегистрыСведений.ФИОФизическихЛиц.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Период.Установить(СтрокаДанных.Period);
		НаборЗаписей.Отбор.ФизическоеЛицо.Установить(ФизЛицо);
		
		Запись = НаборЗаписей.Добавить();
		
		Запись.Период = СтрокаДанных.Period;
		Запись.ФизическоеЛицо = ФизЛицо;
		Запись.Фамилия = СтрокаДанных.Surname;
		Запись.Имя = СтрокаДанных.Name;
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаДанных, "Patronymic") Тогда
			Запись.Отчество = СтрокаДанных.Patronymic;
		КонецЕсли;
		
		НаборЗаписей.ДополнительныеСвойства.Вставить("НеФормироватьНаименование", Истина);
		
		Если Не КР_ОбменRabbitОбщиеМеханизмыКонвертации.НаборЗаписейРегистраЗаписать(
				НаборЗаписей, СообщениеОбмена) Тогда
			Возврат Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область НастройкиЗагрузкиОбъектов       

Функция НастройкаЗагрузки(ПараметрыЗагрузки, ТипДанных)
	
	ШаблонПравилаЗагрузки = "КР_ЗУП_УТ11_ЗагрузкаДанныхСервер.ПЗО_%1";
	
	СтрокаЗагрузки = ПараметрыЗагрузки.Добавить();
	СтрокаЗагрузки.ТипДанных = ТипДанных;
	СтрокаЗагрузки.Отправитель = ""; // любой
	СтрокаЗагрузки.ОчередьОбмена = ""; // любой
	СтрокаЗагрузки.ПравилоЗагрузки = СтрШаблон(ШаблонПравилаЗагрузки, ТипДанных);
	СтрокаЗагрузки.ДополнительныеПараметры = Новый Структура;
	
	Возврат СтрокаЗагрузки;
	
КонецФункции

#КонецОбласти

#КонецОбласти
